priv/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="100000"/>
  </clients>

  <servers>
    <server host="localhost" port="4004" type="tcp"></server>
  </servers>

  <load>
    <user session="ender" start_time="0" unit="second" />
    <user session="publisher" start_time="0" unit="second" />
    <user session="ender" start_time="65" unit="second" />
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session weight="0" name="publisher" type="ts_http">
      <for from="1" to="50" incr="1" var="x">
        <request subst='true'>
          <http method="POST" version="1.1" url="/news" contents='{"content":"%%_x%%"}'>
            <http_header name="Content-Type" value="application/json"/>
          </http>
        </request>
        <thinktime value="1" random="true"/>
      </for>
    </session>

    <session weight="100" name="subscriber" type="ts_http">
      <thinktime value="1"/>
      <request>
        <http method="GET" url="/news" /> 
      </request>
    </session>

    <session weight="0" name="ender" type="ts_http">
      <request>
        <http method="DELETE" url="/news" />
      </request>
    </session>
  </sessions>
</tsung>